In [3]:
import pandas as pd
import numpy as np

In [7]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([5,6,7,8,9,10])
x = pd.DataFrame([s1,s2])
print x

     0    1    2    3    4     5
0  1.0  2.0  3.0  4.0  5.0   NaN
1  5.0  6.0  7.0  8.0  9.0  10.0

In [7]:
import os
cwd = os.getcwd()

print cwd

C:\Users\home

In [4]:
data = pd.read_csv ('C:\\Users\\home\\Downloads\\titanic.csv')
print (data.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [7]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
data['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [19]:
data['Embarked'][~data['Embarked'].isin(data['Embarked'].value_counts().index[:2])] ='Other'

C:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [22]:
pd.qcut(data['Age'],5).value_counts()

(0.419, 19.0]    164
(31.8, 41.0]     144
(41.0, 80.0]     142
(19.0, 25.0]     137
(25.0, 31.8]     127
Name: Age, dtype: int64

In [24]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [42]:
n=5
data.loc[data['Age'] == data['Age'].sort_values(ascending = False).unique()[n-1]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0,B22,S

In [9]:
df1 = data[['PassengerId','Name','Sex']]

df1.head()

   PassengerId                                               Name     Sex
0            1                            Braund, Mr. Owen Harris    male
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2            3                             Heikkinen, Miss. Laina  female
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4            5                           Allen, Mr. William Henry    male

In [10]:
df1['Name'].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [11]:
df1.Name.head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [15]:
data.iloc[0:3,0:4] # you can use this wen index is known

,PassengerId,Survived,Pclass,Name
0,1,0,3,"Braund, Mr. Owen Harris"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina"

In [24]:
print data.iloc[0,3]
data.iloc[:3].head()

Braund, Mr. Owen Harris

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [23]:
data.iloc[1:4,:].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [25]:
#loc is used in case we don't have index ,we can use label
data.loc[0:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [ ]:
data.loc[0:3,"PassengerId"]
#data.loc[1,1] gives error as 1 isn't label
data.loc[:,'PassengerId']

In [47]:
data.loc[0:3,'Name']

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
Name: Name, dtype: object

In [48]:
data.loc[data['Name'] == 'Braund, Mr. Owen Harris',['Sex']]

    Sex
0  male

In [34]:
data[-5:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [40]:
data_sorted = data.sort_values(by = ['Name','Sex'],ascending = ['True','False'])
print data_sorted.head()

     PassengerId  Survived  Pclass                                   Name  \
845          846         0       3                    Abbing, Mr. Anthony
746          747         0       3            Abbott, Mr. Rossmore Edward
279          280         1       3       Abbott, Mrs. Stanton (Rosa Hunt)
308          309         0       2                    Abelson, Mr. Samuel
874          875         1       2  Abelson, Mrs. Samuel (Hannah Wizosky)

        Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279  female  35.0      1      1  C.A. 2673  20.25   NaN        S
308    male  30.0      1      0  P/PP 3381  24.00   NaN        C
874  female  28.0      1      0  P/PP 3381  24.00   NaN        C

In [42]:
pd.crosstab(data.Survived,data.Sex,margins=True)

Sex       female  male  All
Survived
0             81   468  549
1            233   109  342
All          314   577  891

In [10]:
df = pd.DataFrame([[1,2],]*2,columns= ["a","b"])
print (df)
#appply is used to apply a specific function to any particular row or column 
print (df.apply(np.sum,axis = 0))
print (df.apply(np.sum,axis = 1))

   a  b
0  1  2
1  1  2
a    2
b    4
dtype: int64
0    3
1    3
dtype: int64

In [14]:
df['new_x'] = df.apply ( lambda x : x['a'] * 2 ,axis = 1)

df['2'] = df.apply (lambda x : x[0]*5 ,axis = 0 )
print (df)

   a  b  new_x   2
0  1  2      2 NaN
1  1  2      2 NaN

In [23]:
df = pd.DataFrame([[1,2],[3,4]],columns= ["a","b"])
print (df)
df.mean(axis = 1)

   a  b
0  1  2
1  3  4

0    1.5
1    3.5
dtype: float64

In [ ]:
data.apply(lambda x : x["Fare"]*70 ,axis = 1)

In [15]:
df.div(10,axis = 0)

     a    b  new_x   2
0  0.1  0.2    0.2 NaN
1  0.1  0.2    0.2 NaN

In [4]:
data2 = [['disney land','united states','5 lakhs'],[np.NaN,'USA',np.NaN],['northern lights','norway','3 lakhs'],[np.NaN,'America',np.NaN]]

x = pd.DataFrame(data2,columns = ['fav place','country','cost'])
print (x)

         fav place        country     cost
0      disney land  united states  5 lakhs
1              NaN            USA      NaN
2  northern lights         norway  3 lakhs
3              NaN        America      NaN

In [8]:
x.loc[x['country'] == 'USA']

  fav place country cost
1       NaN     USA  NaN

In [49]:
cols = x.columns
new_cols = np.arange(len(cols))
x.columns = new_cols
print x

                 0              1        2
0      disney land  united states  5 lakhs
1              NaN            USA      NaN
2  northern lights         norway  3 lakhs
3              NaN        America      NaN

In [50]:
x2 = x.dropna()
print x2
#row index remians same (intial index is stored)

                 0              1        2
0      disney land  united states  5 lakhs
2  northern lights         norway  3 lakhs

In [52]:
x3 = x.dropna( axis = 1)
print x3
#we can also remove coulmns containing Na using axis key

               1
0  united states
1            USA
2         norway
3        America

In [55]:
x4 = x.dropna(thresh=3)
print x4
#only the rows with at least 2 non-NA values.

                 0              1        2
0      disney land  united states  5 lakhs
2  northern lights         norway  3 lakhs

In [57]:
x5 = x.fillna(0)
x6 = x.fillna(x.mean())
x7 = x.fillna(x.mode())
print x,x5,x6,x7

                 0              1        2
0      disney land  united states  5 lakhs
1              NaN            USA      NaN
2  northern lights         norway  3 lakhs
3              NaN        America      NaN                  0              1        2
0      disney land  united states  5 lakhs
1                0            USA        0
2  northern lights         norway  3 lakhs
3                0        America        0                  0              1        2
0      disney land  united states  5 lakhs
1              NaN            USA      NaN
2  northern lights         norway  3 lakhs
3              NaN        America      NaN                  0              1        2
0      disney land  united states  5 lakhs
1  northern lights            USA  5 lakhs
2  northern lights         norway  3 lakhs
3              NaN        America      NaN

In [58]:
x8 = x.replace('norway','northern lights')
print x8

                 0                1        2
0      disney land    united states  5 lakhs
1              NaN              USA      NaN
2  northern lights  northern lights  3 lakhs
3              NaN          America      NaN